---
kind: method
id: M:Autodesk.Revit.DB.ExportLinetypeTable.GetLinetypeTableIterator
source: html/8eb35b75-fc0b-5057-6ffd-e307cbb086cf.htm
---
# Autodesk.Revit.DB.ExportLinetypeTable.GetLinetypeTableIterator Method

Returns a ExportLinetypeTableIterator that iterates through the collection.

## Syntax (C#)
```csharp
public ExportLinetypeTableIterator GetLinetypeTableIterator()
```

## Returns
A ExportLinetypeTableIterator object that can be used to iterate through key-value pairs in the collection.